export const questions = [
  {
    text: "Что такое техника безопасности?",
    answers: [
      "Набор правил, направленных на предотвращение несчастных случаев",
      "Услуга по охране труда",
      "Оборудование для защиты работников",
    ],
    correct: 0,
  },
  {
    text: "Какова основная цель охраны труда?",
    answers: [
      "Увеличение производительности",
      "Обеспечение здоровья и безопасности работников",
      "Уменьшение затрат на производство",
    ],
    correct: 1,
  },
  {
    text: "Что такое производственный травматизм?",
    answers: [
      "Любое заболевание работника",
      "Несчастные случаи на производстве",
      "Нанесение вреда здоровью вне рабочего времени",
    ],
    correct: 1,
  },
  {
    text: "Каковы обязанности работодателя в области охраны труда?",
    answers: [
      "Обучать работников",
      "Обеспечивать безопасные условия труда",
      "Все вышеперечисленное",
    ],
    correct: 2,
  },
  {
    text: "Какие меры пожарной безопасности необходимо соблюдать на рабочем месте?",
    answers: [
      "Хранить легковоспламеняющиеся материалы вдали от источников тепла",
      "Игнорировать правила",
      "Использовать открытую пламя для освещения",
    ],
    correct: 0,
  },
  {
    text: "Что такое эвакуационный план?",
    answers: [
      "Схема расположения офисов",
      "Порядок действий при экстренной ситуации",
      "План по сокращению расходов",
    ],
    correct: 1,
  },
  {
    text: "Что делать при обнаружении пожара?",
    answers: [
      "Попробовать потушить самостоятельно",
      "Позвонить в службу спасения и эвакуироваться",
      "Продолжать работать",
    ],
    correct: 1,
  },
  {
    text: "Какие виды огнетушителей существуют?",
    answers: [
      "Водяные, порошковые, углекислотные",
      "Твердые и жидкие",
      "Никаких",
    ],
    correct: 0,
  },
  {
    text: "Как правильно пользоваться огнетушителем?",
    answers: [
      "Нажать на ручку и направить на огонь",
      "Бросить его в огонь",
      "Не трогать, если огонь небольшой",
    ],
    correct: 0,
  },
  {
    text: "Какие основные опасности при работе с электрооборудованием?",
    answers: ["Удары током", "Падение оборудования", "Все вышеперечисленное"],
    correct: 2,
  },
  {
    text: "Что такое заземление?",
    answers: [
      "Установка электрооборудования",
      "Безопасное подключение к электросети",
      "Устранение электрических перегрузок",
    ],
    correct: 1,
  },
  {
    text: "Каковы основные правила работы с электрическими приборами?",
    answers: [
      "Игнорировать инструкции",
      "Проверять оборудование перед использованием",
      "Работать без перчаток",
    ],
    correct: 1,
  },
  {
    text: "Что делать при повреждении электропроводки?",
    answers: [
      "Попробовать отремонтировать самостоятельно",
      "Сообщить об этом ответственному лицу",
      "Игнорировать",
    ],
    correct: 1,
  },
  {
    text: "Какова роль защитных устройств в электробезопасности?",
    answers: [
      "Они не важны",
      "Защита работников от электрического тока",
      "Увеличивают эффективность работы",
    ],
    correct: 1,
  },
  {
    text: "Каковы основные требования к организации рабочего места?",
    answers: [
      "Чистота и порядок",
      "Наличие всех необходимых инструментов",
      "Все вышеперечисленное",
    ],
    correct: 2,
  },
  {
    text: "Что такое охрана труда при работе с механическим оборудованием?",
    answers: [
      "Правила работы с ручными инструментами",
      "Меры по предотвращению несчастных случаев",
      "Использование защитных очков",
    ],
    correct: 1,
  },
  {
    text: "Какие меры предосторожности необходимо соблюдать при работе с химическими веществами?",
    answers: [
      "Использовать защитные средства",
      "Не читать инструкции",
      "Работать в закрытом помещении",
    ],
    correct: 0,
  },
  {
    text: "Каковы основные правила безопасности при использовании ручного инструмента?",
    answers: [
      "Не проверять инструмент перед использованием",
      "Использовать инструменты по назначению",
      "Игнорировать правила",
    ],
    correct: 1,
  },
  {
    text: "Что такое риск-менеджмент в охране труда?",
    answers: [
      "Процесс оценки и снижения рисков",
      "Увеличение производительности",
      "Наблюдение за работниками",
    ],
    correct: 0,
  },
  {
    text: "Каковы признаки профессионального выгорания?",
    answers: [
      "Увеличение продуктивности",
      "Усталость и апатия",
      "Увлечение работой",
    ],
    correct: 1,
  },
  {
    text: "Какие меры можно предпринять для предотвращения стресса на рабочем месте?",
    answers: [
      "Работать больше",
      "Уделять внимание отдыху",
      "Игнорировать личные проблемы",
    ],
    correct: 1,
  },
  {
    text: "Какова роль командной работы в обеспечении безопасности?",
    answers: [
      "Не имеет значения",
      "Повышает ответственность каждого",
      "Уменьшает производительность",
    ],
    correct: 1,
  },
  {
    text: "Как управлять конфликтами на рабочем месте для предотвращения травматизма?",
    answers: [
      "Игнорировать конфликты",
      "Участвовать в их разрешении",
      "Увеличивать напряженность",
    ],
    correct: 1,
  },
  {
    text: "Что такое психоэмоциональная безопасность на рабочем месте?",
    answers: [
      "Атмосфера доверия и поддержки",
      "Строгое подчинение",
      "Отсутствие общения",
    ],
    correct: 0,
  },
  {
    text: "Каковы действия работника при получении травмы на рабочем месте?",
    answers: [
      "Сразу продолжить работу",
      "Сообщить о травме и оказать себе первую помощь",
      "Игнорировать травму",
    ],
    correct: 1,
  },
  {
    text: "Что такое первая помощь?",
    answers: [
      "Лечение серьезных травм",
      "Оказание помощи до прибытия медицинской службы",
      "Консультация врача",
    ],
    correct: 1,
  },
  {
    text: "Какие симптомы могут указывать на отравление химическими веществами?",
    answers: ["Головная боль, тошнота", "Усталость", "Никаких симптомов"],
    correct: 0,
  },
  {
    text: "Каковы меры предосторожности при работе на высоте?",
    answers: [
      "Использование страховочных систем",
      "Игнорирование высоты",
      "Работать без защиты",
    ],
    correct: 0,
  },
  {
    text: "Что такое травматизм при выполнении офисных работ?",
    answers: [
      "Травмы, связанные с физической работой",
      "Несчастные случаи, происходящие в офисе",
      "Травмы, связанные с домашними делами",
    ],
    correct: 1,
  },
  {
    text: "Какие законы регулируют охрану труда в вашей стране?",
    answers: [
      "Не имеют значения",
      "Законы о трудовых отношениях",
      "Законы о налогах",
    ],
    correct: 1,
  },
  {
    text: "Какова роль профсоюзов в охране труда?",
    answers: [
      "Защита интересов работников",
      "Увеличение зарплаты",
      "Игнорирование проблем",
    ],
    correct: 0,
  },
  {
    text: "Какие документы необходимы для проведения инструктажа по охране труда?",
    answers: [
      "Протоколы и инструкции",
      "Никакие документы не нужны",
      "Только устные указания",
    ],
    correct: 0,
  },
  {
    text: "Что такое аттестация рабочих мест?",
    answers: [
      "Оценка условий труда",
      "Подбор сотрудников",
      "Увеличение производительности",
    ],
    correct: 0,
  },
  {
    text: "Каковы основные источники информации о безопасности на рабочем месте?",
    answers: [
      "Справочники, интернет",
      "Только личный опыт",
      "Не имеет значения",
    ],
    correct: 0,
  },
  {
    text: "Что делать, если работник игнорирует правила охраны труда?",
    answers: [
      "Сообщить об этом руководству",
      "Закрыть глаза",
      "Ничего не делать",
    ],
    correct: 0,
  },
  {
    text: "Какое расстояние должно быть между электрическими проводами и находящимися вблизи источниками воды?",
    answers: [
      "Не менее 1 метра",
      "Не менее 2 метров",
      "Не менее 3 метров",
      "Не менее 5 метров",
    ],
    correct: 2,
  },
];
