<template>
  <div class="container">
    <section class="welcome-section">
      <h1>Добро пожаловать!</h1>
      <p>
        Мы рады представить вам наше инновационное веб-приложение, разработанное
        специально для проверки и повышения знаний в области техники
        безопасности и охраны труда. Это решение поможет вам и вашей команде
        создать безопасную и продуктивную рабочую среду.
      </p>
    </section>

    <section class="importance-section">
      <h2>Почему это важно?</h2>
      <p>
        В условиях современного производства, охрана труда и соблюдение правил
        техники безопасности становятся как никогда актуальными. Каждый год
        множество рабочих травм и несчастных случаев происходит из-за незнания
        или игнорирования правил безопасности. Наша платформа призвана помочь
        предотвратить подобные ситуации, обучая сотрудников основам безопасности
        и обеспечивая их постоянное развитие знаний в этой важной области.
      </p>
    </section>

    <section class="about-app-section">
      <h2>О нашем приложении</h2>
      <ul>
        <li>
          Интерактивные тесты и викторины: Проверяйте свои знания с помощью
          разнообразных вопросов, которые охватывают все аспекты техники
          безопасности и охраны труда.
        </li>
        <li>
          Курсы и обучающие материалы: Доступ к учебным ресурсам, которые
          помогут вам разобраться в актуальных законах, правилах и нормах,
          связанных с охраной труда.
        </li>
      </ul>
    </section>

    <section class="advantages-section">
      <h2>Преимущества нашего приложения</h2>
      <ul>
        <li>
          Интуитивно понятный интерфейс: Мы понимаем, как важна простота
          использования. Наш интерфейс позволяет даже новичкам быстро освоить
          его, что удобно для всех работников, независимо от их уровня
          компьютерной грамотности.
        </li>
        <li>
          Актуальные тесты и материалы: Все содержание нашего приложения
          регулярно обновляется, чтобы соответствовать последним стандартам и
          изменениям в законодательстве. Вы можете быть уверены, что ваши знания
          всегда будут актуальны.
        </li>
        <li>
          Персонализированный подход: На основе ваших ответов, система
          анализирует уровень ваших знаний и предлагает дополнительные материалы
          для изучения, что позволяет индивидуально подойти к обучению.
        </li>
        <li>
          Анализ и отчетность: После каждой сессии тестирования вы получаете
          детальный отчет о своих результатах, что помогает определить сильные и
          слабые стороны. Это особенно полезно для менеджеров, стремящихся
          улучшить уровень безопасности в команде.
        </li>
      </ul>
    </section>

    <section class="test-section">
      <h2>Готовы пройти тестирование?</h2>
      <p>
        Проверьте свои знания по технике безопасности и охране труда, пройдя наш
        тест. Это поможет вам закрепить полученные знания и удостовериться в их
        актуальности.
      </p>
      <button class="start-test-button" @click="$router.push('/test')">
        Начать тест
      </button>
    </section>
  </div>
</template>

<script setup lang="ts"></script>

<style scoped>
.container {
  padding: 2rem;
  background-color: #f9f9f9;
  margin-left: 20vh;
  margin-right: 10vh;
}

h1,
h2 {
  color: #1a3d7b;
}

p,
li {
  color: #333;
  font-size: 1.1rem;
  line-height: 1.5;
}

.welcome-section,
.importance-section,
.about-app-section,
.advantages-section {
  margin-bottom: 2.5rem;
  padding: 1.5rem;
  background: #fff;
  border-radius: 8px;
  box-shadow: 0 2px 4px rgba(0, 0, 0, 0.1);
  width: fit-content;
}

.test-section {
  margin-top: 2.5rem;
  padding: 1.5rem;
  background: #fff;
  border-radius: 8px;
  box-shadow: 0 2px 4px rgba(0, 0, 0, 0.1);
  text-align: center;
}

.start-test-button {
  margin-top: 1rem;
  padding: 0.5rem 1rem;
  background-color: #1a3d7b;
  color: #fff;
  border: none;
  border-radius: 4px;
  cursor: pointer;
  font-size: 1rem;
}

ul {
  list-style-type: disc;
  padding-left: 1.5rem;
}
</style>
